posts/2015-01-13-reloading-zshrc.org
#+date: <2015-01-13>
#+filetags: zsh
#+title: Reloading zshrc

I use zsh instead of bash. If that doesn't mean anything to you, then just skip the rest of this post. I've been restarting the terminal after every change to my zshrc file. I knew there had to be a way to quickly reload the file without restarting the terminal.

It turns out that typing ". ~/.zshrc" will do it. The problem is that I'm not likely to remember it. I found this nice tip at [[http://www.codem0nk3y.com/2012/12/how-to-reload-zsh-config/][codeM0nK3Y.com]]: add the following to your zshconfig:

#+begin_example shell
alias reload=". ~/.zshrc && echo 'ZSH config reloaded from ~/.zshrc'"
#+end_example

Now, just type "reload" and you're all set.


#+begin_tagline
Tagged: zsh
#+end_tagline
