docs/posts/2015-01-13-reloading-zshrc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reloading zshrc</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Reloading zshrc</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I use zsh instead of bash. If that doesn&rsquo;t mean anything to you, then just skip the rest of this post. I&rsquo;ve been restarting the terminal after every change to my zshrc file. I knew there had to be a way to quickly reload the file without restarting the terminal.
</p>

<p>
It turns out that typing &ldquo;. ~/.zshrc&rdquo; will do it. The problem is that I&rsquo;m not likely to remember it. I found this nice tip at <a href="http://www.codem0nk3y.com/2012/12/how-to-reload-zsh-config/">codeM0nK3Y.com</a>: add the following to your zshconfig:
</p>

<pre class="example" id="org0307e22">
alias reload=". ~/.zshrc &amp;&amp; echo 'ZSH config reloaded from ~/.zshrc'"
</pre>

<p>
Now, just type &ldquo;reload&rdquo; and you&rsquo;re all set.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
